[XComGame.UIArmory_Loadout]
[UIArmory_Loadout]
m_strInventoryLabels[eInvSlot_TacticalGadget]=TACTICAL GADGET

; ###### New Items ######

[GrapplingHook X2WeaponTemplate]
FriendlyName = "Grappling Hook"
FriendlyNamePlural = "Grappling Hooks"
BriefSummary = "Grappling Hook."
TacticalText = "<Bullet/> The grapple module allows soldiers to traverse the battlefield rapidly. It does not takes an action to use, but does have a short cooldown."

[GrapplingHookPowered X2WeaponTemplate]
FriendlyName = "Powered Grappling Hook"
FriendlyNamePlural = "Powered Grappling Hooks"
BriefSummary = "Powered Grappling Hook."
TacticalText = "<Bullet/> The grapple module allows soldiers to traverse the battlefield rapidly. It does not takes an action to use, but does have a short cooldown."

; ###### Vanilla Override ######

; ### Techs ###
[SpiderSuit X2TechTemplate]
DisplayName="Corsair Suit"
Summary="Spotty records from the ruined mainframe at XCOM HQ indicate an early prototype for a light armor suit coupled with a grappling hook never came to fruition. Our recent mastery of the aliens' materials may allow us to revive the concept with additional tactical functionality." 
CodeName="Fisher"
LongDescription="With the variety of environments our forces are currently engaging the enemy in, we need to give them every opportunity to gain a tactical advantage in the field. With that in mind, our latest armor prototype incorporates the capability to mount Tactical Gadgets to assist with battlefield mobility. Our first of these is a basic powered-ascent mechanism capable of propelling the wearer to heights of over 10m with high levels of stability. The suit utilizes a number of micro-servo motors operating in sequence to aid in distributing the load throughout the armor, with the added side-effect of enhanced reflexes provided to the wearer. Although Central has made vague references to the previous science officer serving XCOM, he doesn't seem interested in discussing her efforts with me directly. I'm guessing this grapple design was something she created in collaboration with dad before XCOM fell. L. Shen."

; ### Items ###
[LightPlatedArmor X2ArmorTemplate]
FriendlyName="Corsair Suit"
FriendlyNamePlural="Corsair Suits"
BriefSummary="ADVENT materials tech lead us to this lightweight suit, which retains the increased protection of ADVENT plating, but also enhances mobility and adds the capability to mount Tactical Gadgets for fast movement around the battlefield."
TacticalText="<Bullet/> The Corsair Suit adds mobility and an increased chance of taking grazing shots instead of outright hits.\n<Bullet/> The Tactical Gadget mount allows soldiers to attach specialized modules that enable rapid battlefield mobility."

[LightPoweredArmor X2ArmorTemplate]
FriendlyName="Wraith Suit"
FriendlyNamePlural="Wraith Suits"
BriefSummary="The lightweight variant of our powered armor system not only boosts our soldiers' reflexes and speed, it also incorporates experimental warp technology, permitting the wearer to briefly change dimensional phase and effortlessly pass right through obstacles."
TacticalText="<Bullet/> The Wraith Suit adds mobility and an increased chance of taking grazing shots instead of outright hits.\n<Bullet/> The Tactical Gadget mount allows soldiers to attach specialized modules that enable rapid battlefield mobility.\n<Bullet/> The Wraith Suit can allow the wearer to pass directly through walls and obstacles."